export class fovModel{
  name:string;
  words:string;
  list:string[];
  date:string;
}

export const imgList:string[] = [
  "a_0.jpg",
  "a_1.jpg",
  "a_2.jpg",
  "a_3.jpg",
  "a_4.jpg",
  "b_0.jpg",
  "b_1.jpg",
  "c_0.jpg",
  "c_1.jpg",
  "c_2.jpg",
  "d_0.jpg",
  "d_1.jpg",
  "e_0.jpg",
  "e_1.jpg",
  "e_2.jpg",
  "e_3.jpg",
  "f_0.jpg",
  "f_1.jpg",
  "g_0.jpg",
  "h_0.jpg",
  "h_1.jpg",
  "i_0.jpg",
  "i_1.jpg",
  "i_2.jpg",
  "i_3.jpg",
  "i_4.jpg",
  "j_0.jpg",
  "j_1.jpg",
  "j_2.jpg",
  "k_0.jpg",
  "k_1.jpg",
  "l_0.jpg",
  "l_1.jpg",
  "l_2.jpg",
  "l_3.jpg",
  "m_0.jpg",
  "m_1.jpg",
  "m_2.jpg",
  "n_0.jpg",
  "n_1.jpg",
  "n_2.jpg",
  "o_0.jpg",
  "o_1.jpg",
  "p_0.jpg",
  "p_1.jpg",
  "q_0.jpg",
  "q_1.jpg",
  "r_0.jpg",
  "r_1.jpg",
  "r_2.jpg",
  "r_3.jpg",
  "s_0.jpg",
  "s_1.jpg",
  "s_2.jpg",
  "t_0.jpg",
  "t_1.jpg",
  "u_0.jpg",
  "u_1.jpg",
  "v_0.jpg",
  "v_1.jpg",
  "v_2.jpg",
  "v_3.jpg",
  "w_0.jpg",
  "w_1.jpg",
  "x_0.jpg",
  "x_1.jpg",
  "x_2.jpg",
  "y_0.jpg",
  "y_1.jpg",
  "y_2.jpg",
  "z_0.jpg",
  "z_1.jpg"
];

export class imgdata{
  name:string;
  region:string;
  xy:string;
}
export const imgDatas:imgdata[] = [
  {
    "name": "a_0",
    "region": "希克曼, 肯塔基州",
    "xy": "36°35'20.8 N 89°20'26.9 W"
  },
  {
    "name": "a_1",
    "region": "农场岛, 缅因州",
    "xy": "45°43'43.8 N 69°46'08.9 W"
  },
  {
    "name": "a_2",
    "region": "瓜赫马兹湖, 阿塞拜疆",
    "xy": "40°39'50.8 N 47°06'36.2 E"
  },
  {
    "name": "a_3",
    "region": "育空三角洲, 阿拉斯加",
    "xy": "62°33'17.7 N 164°56'10.3 W"
  },
  {
    "name": "a_4",
    "region": "米约萨湖, 挪威",
    "xy": "60°45'52.7 N 10°56'43.2 E"
  },
  {
    "name": "b_0",
    "region": "霍拉本德, 阿肯色州",
    "xy": "35°08'41.1 N 93°03'16.5 W"
  },
  {
    "name": "b_1",
    "region": "乌迈塔, 巴西",
    "xy": "7°37'00.1 S 62°55'17.0 W"
  },
  {
    "name": "c_0",
    "region": "黑岩沙漠, 内华达州",
    "xy": "40°47'15.8 N 119°12'13.0 W"
  },
  {
    "name": "c_1",
    "region": "欺骗岛, 南极洲",
    "xy": "62°57'22.3 S 60°38'32.8 W"
  },
  {
    "name": "c_2",
    "region": "假河, 路易斯安那州",
    "xy": "30°38'39.7 N 91°26'45.7 W"
  },
  {
    "name": "d_0",
    "region": "阿基米斯基岛, 加拿大",
    "xy": "53°00'58.5 N 81°18'24.6 W"
  },
  {
    "name": "d_1",
    "region": "坦杜湖, 澳大利亚",
    "xy": "32°37'17.8 S 142°04'21.4 E"
  },
  {
    "name": "e_0",
    "region": "冰川填充的峡湾, 西藏",
    "xy": "29°15'46.9 N 96°19'03.8 E"
  },
  {
    "name": "e_1",
    "region": "鄂霍次克海",
    "xy": "54°42'50.3 N 136°34'20.4 E"
  },
  {
    "name": "e_2",
    "region": "贝洛纳高原",
    "xy": "20°30'00.0 S 158°30'00.0 E"
  },
  {
    "name": "e_3",
    "region": "布雷扎梅尔库尔冰川, 冰岛",
    "xy": "64°05'45.0 N 16°21'45.6 W"
  },
  {
    "name": "f_0",
    "region": "马托格罗索, 巴西",
    "xy": "13°50'26.9 S 55°17'55.0 W"
  },
  {
    "name": "f_1",
    "region": "克鲁格国家公园, 南非",
    "xy": "28°44'01.3 S 29°12'30.1 E"
  },
  {
    "name": "g_0",
    "region": "丰特博阿, 亚马逊",
    "xy": "2°26'30.8 S 66°16'43.7 W"
  },
  {
    "name": "h_0",
    "region": "西南吉尔吉斯斯坦",
    "xy": "40°14'03.6 N 71°14'22.8 E"
  },
  {
    "name": "h_1",
    "region": "霍林斯基区, 俄罗斯",
    "xy": "52°02'50.4 N 109°46'51.2 E"
  },
  {
    "name": "i_0",
    "region": "博尔加比格兹, 冰岛",
    "xy": "64°45'46.4 N 22°27'28.0 W"
  },
  {
    "name": "i_1",
    "region": "卡南代瓜湖, 纽约",
    "xy": "42°47'11.0 N 77°42'58.1 W"
  },
  {
    "name": "i_2",
    "region": "埃托沙国家公园, 纳米比亚",
    "xy": "18°29'15.2 S 16°10'14.6 E"
  },
  {
    "name": "i_3",
    "region": "杰贝尔瓦尔基兹, 摩洛哥",
    "xy": "28°18'01.5 N 10°33'58.5 W"
  },
  {
    "name": "i_4",
    "region": "霍卢赫劳恩冰原, 冰岛",
    "xy": "64°51'11.2 N 16°49'37.2 W"
  },
  {
    "name": "j_0",
    "region": "大堡礁",
    "xy": "18°20'55.3 S 146°50'51.4 E"
  },
  {
    "name": "j_1",
    "region": "卡拉卡亚大坝, 土耳其",
    "xy": "38°29'37.7 N 38°26'39.5 E"
  },
  {
    "name": "j_2",
    "region": "苏必利尔湖, 北美洲",
    "xy": "46°41'10.2 N 90°23'11.5 W"
  },
  {
    "name": "k_0",
    "region": "西尔米利克国家公园, 加拿大",
    "xy": "72°05'01.1 N 76°48'42.9 W"
  },
  {
    "name": "k_1",
    "region": "格尔木, 中国",
    "xy": "35°36'46.3 N 95°03'45.9 E"
  },
  {
    "name": "l_0",
    "region": "努桑塔拉, 印度尼西亚",
    "xy": "0°58'18.1 S 116°41'58.9 E"
  },
  {
    "name": "l_1",
    "region": "新疆, 中国",
    "xy": "40°04'02.8 N 77°40'00.7 E"
  },
  {
    "name": "l_2",
    "region": "里贾纳, 萨斯喀彻温省, 加拿大",
    "xy": "50°11'51.7 N 104°17'15.4 W"
  },
  {
    "name": "l_3",
    "region": "里贾纳, 萨斯喀彻温省, 加拿大",
    "xy": "50°12'41.3 N 104°43'38.1 W"
  },
  {
    "name": "m_0",
    "region": "谢南多厄河, 弗吉尼亚",
    "xy": "38°46'32.2 N 78°24'07.1 W"
  },
  {
    "name": "m_1",
    "region": "波托马克河",
    "xy": "38°46'32.2 N 78°24'07.1 W"
  },
  {
    "name": "m_2",
    "region": "天山山脉, 吉尔吉斯斯坦",
    "xy": "42°07'16.4 N 80°02'44.1 E"
  },
  {
    "name": "n_0",
    "region": "亚帕卡尼, 玻利维亚",
    "xy": "17°18'29.7 S 63°53'19.0 W"
  },
  {
    "name": "n_1",
    "region": "亚帕卡尼, 玻利维亚",
    "xy": "17°18'29.7 S 63°53'19.0 W"
  },
  {
    "name": "n_2",
    "region": "圣米格尔-杜阿拉瓜亚, 巴西",
    "xy": "12°56'44.3 S 50°29'42.0 W"
  },
  {
    "name": "o_0",
    "region": "火山口湖, 俄勒冈",
    "xy": "42°56'10.0 N 122°06'04.7 W"
  },
  {
    "name": "o_1",
    "region": "马尼夸根水库",
    "xy": "51°22'42.4 N 68°40'27.2 W"
  },
  {
    "name": "p_0",
    "region": "麦肯齐河三角洲, 加拿大",
    "xy": "68°12'54.4 N 134°23'15.3 W"
  },
  {
    "name": "p_1",
    "region": "里韦拉尔塔, 玻利维亚",
    "xy": "10°52'44.0 S 66°02'52.0 W"
  },
  {
    "name": "q_0",
    "region": "洛纳尔陨石坑, 印度",
    "xy": "19°58'36.8 N 76°30'30.6 E"
  },
  {
    "name": "q_1",
    "region": "坦博拉火山, 印度尼西亚",
    "xy": "8°14'31.3 S 117°59'31.2 E"
  },
  {
    "name": "r_0",
    "region": "门多萨湖, 阿根廷",
    "xy": "42°41'14.9 S 71°52'21.7 W"
  },
  {
    "name": "r_1",
    "region": "松德里奥省, 意大利",
    "xy": "46°17'38.3 N 9°25'14.5 E"
  },
  {
    "name": "r_2",
    "region": "佛罗里达群岛",
    "xy": "24°45'30.4 N 81°31'53.6 W"
  },
  {
    "name": "r_3",
    "region": "峡谷地国家公园, 犹他州",
    "xy": "38°26'27.8 N 109°45'03.3 W"
  },
  {
    "name": "s_0",
    "region": "麦肯齐河",
    "xy": "68°25'01.0 N 134°08'35.2 W"
  },
  {
    "name": "s_1",
    "region": "恩贾梅纳, 乍得",
    "xy": "12°00'27.7 N 15°03'46.2 E"
  },
  {
    "name": "s_2",
    "region": "查帕雷河, 玻利维亚",
    "xy": "16°56'04.7 S 65°13'44.2 W"
  },
  {
    "name": "t_0",
    "region": "利瓦, 阿拉伯联合酋长国",
    "xy": "23°10'30.0 N 53°47'52.8 E"
  },
  {
    "name": "t_1",
    "region": "勒拿河三角洲",
    "xy": "72°52'40.3 N 129°31'51.5 E"
  },
  {
    "name": "u_0",
    "region": "峡谷地国家公园, 犹他州",
    "xy": "38°16'09.1 N 109°55'32.7 W"
  },
  {
    "name": "u_1",
    "region": "班福斯国家野生动物保护区, 怀俄明州",
    "xy": "41°19'26.0 N 105°46'13.9 W"
  },
  {
    "name": "u_2",
    "region": "波托马克河, 弗吉尼亚",
    "xy": "38°29'06.4 N 77°10'19.9 W"
  },
  {
    "name": "v_0",
    "region": "切利纳河和梅杜纳河, 意大利",
    "xy": "46°06'41.4 N 12°45'26.6 E"
  },
  {
    "name": "v_1",
    "region": "新南威尔士州, 澳大利亚",
    "xy": "34°17'11.2 S 150°49'32.4 E"
  },
  {
    "name": "v_2",
    "region": "帕德玛河, 孟加拉国",
    "xy": "23°21'03.9 N 90°33'06.9 E"
  },
  {
    "name": "v_3",
    "region": "梅普尔顿, 缅因州",
    "xy": "46°32'40.5 N 68°15'06.4 W"
  },
  {
    "name": "w_0",
    "region": "波诺伊河, 俄罗斯",
    "xy": "67°02'10.9 N 40°20'19.3 E"
  },
  {
    "name": "w_1",
    "region": "拉普里马韦拉, 哥伦比亚",
    "xy": "5°26'57.9 N 69°47'57.0 W"
  },
  {
    "name": "x_0",
    "region": "沃尔斯滕霍尔姆峡湾, 格陵兰",
    "xy": "76°44'03.8 N 68°36'23.3 W"
  },
  {
    "name": "x_1",
    "region": "戴维斯海峡, 格陵兰",
    "xy": "62°14'14.8 N 49°34'49.9 W"
  },
  {
    "name": "x_2",
    "region": "塞梅尔苏克市, 格陵兰",
    "xy": "66°37'05.2 N 36°22'05.9 W"
  },
  {
    "name": "y_0",
    "region": "比奥比奥河, 智利",
    "xy": "37°16'02.4 S 72°43'42.9 W"
  },
  {
    "name": "y_1",
    "region": "维里拉河口, 秘鲁",
    "xy": "5°51'53.4 S 80°43'51.6 W"
  },
  {
    "name": "y_2",
    "region": "拉姆齐, 新西兰",
    "xy": "43°31'19.4 S 170°49'53.7 E"
  },
  {
    "name": "z_0",
    "region": "普里马韦拉杜莱斯特, 巴西",
    "xy": "15°29'38.9 S 54°20'27.5 W"
  },
  {
    "name": "z_1",
    "region": "穆罕默德·布迪亚夫, 阿尔及利亚",
    "xy": "34°59'19.3 N 4°23'20.8 E"
  }
];